# Команда Print:
print('Hello Python')
# sep=', ' - дозволяє вивести результат через заданий проміжок, наприклад кому з пробілом
# end=' :)' - додає вказаний символ в кінці команди print, наприклад пробіл і смайлик
# \ - дозволяє введення спецсимволів
print('John\'s book')
print('Hello, Danilo! Your\'s job is done at', 5, 'o\'clock', sep=', ', end=':)')
print('\n') # - перейти на нижній рядок (enter)
print('\t') # - ставить tab в тексті

# Математика:
# +, -, *, / - база
# % - залишок від ділення, прикл: 10 % 3 = 1, тому що 3 поміщається в числі 10, три цілих рази, а 9 - 10 = 1
# ** - приведення до степеню
# min() - знайти мінімальний елемент з усіх введених
print(min(5, 1, 7, 3))
# max() - знайти максимальний елемент з усіх введених
print(max(1, 5, 6, 2))
# abs() - знайти число по модулю
print(abs(-3))
# pow() - вставити число в певну ступінь, те саме, що і **
print(pow(2, 3))
print(2 ** 3)
# round - округляє число до цілого числа і міняє клас з float на int
print(round(4.629))
x = round(5.389)
print(type(x))

# Отримання інформації
input('Введи цифру: ')
