# Змінні та типи даних
# Змінна називається на англійській мові та не може містити спецсимволів

# Способи іменування змінних:
# snake_case
# camelCase
# kebab-case
# PascalCase - використовується для класів

# Змінну можна створити, внести в неї певну інфу, перезаписати цю інфу іншою і видалити її
number = 8 # - створення
print(number)
number = 5 # - перезапис
print(number)
del number # - видалення
#print(number) # - після такої дії програма видасть повідомлення про те, що вивести змінну неможливо, бо вона вже видалена
num = -4485.2855835
word = "Hello"
boolean = False # - або True

# Типи даних:
# int - integer, ціле число
# float - дробове число
# bool - boolean, логічне значення тру-фолс
# str - string, строка або просто текст

# Невелика програма калькулятор
a = int(input('Enter number 1: ')) #int
b = input('Enter number 2: ') #str

a = a + 5 # - дозволяє додати до змінної якесь значення
a += 5 # - виконує ту саму функцію

print (a + int(b))
